tests/staf-tests/functional-tests/shared/data/dsml/suites/03dsmlerrsuite/data/add_novalue_beexist.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 530
SOAPAction: batchRequest

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
<batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core"
   requestID="[attr] element has no child [value] element"
   >
<addRequest dn="uid=aubergine,ou=People,o=dsmlfe.com">
<attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
<attr name="sn">
        <value>auber</value>
        </attr>
<attr name="cn">
        <value>Aubert Ginette</value>
        </attr>
<attr name="givenname">
</attr>
</addRequest>
</batchRequest>
</soap-env:Body>
</soap-env:Envelope>
